Repository: sheilagomes/wp-trad
Catalog: tm/PHP_en-pt_BR.tmx
Source language: en
Languages: pt_br

source: Next
pt_br: Como nós geramos os formatos

source: This manual is written in XML using the DocBook XML DTD, using DSSSL (Document Style and Semantics Specification Language) for formatting, and experimentally the XSLT (Extensible Stylesheet Language Transformations) for maintenance and formatting.
pt_br: Experimentalmente XSLT (Extensible Stylesheet Language Transformations) para manutenção e formatação.

source: Using XML as a source format gives us the ability to generate many output formats from the source files, while only maintaining one source document for all formats.
pt_br: Utilizando XML como meta dado nos permite gerar vários outros formatos a partir dos arquivos fonte, ao mesmo tempo que a manutenção é feita em um único lugar para todas as versões.

source: The tools used for formatting HTML and TeX versions are Jade, written by James Clark and The Modular DocBook Stylesheets written by Norman Walsh.
pt_br: As ferramentas utilizadas para criar as versões HTML e TeX são o Jade, escrito por James Clark, e The Modular DocBook Stylesheets, escrito por Norman Walsh.

source: We use Microsoft HTML Help Workshop to generate the Windows HTML Help format of the manual, and of course PHP itself to do some additional conversions and formatting.
pt_br: Nós utilizamos o Microsoft HTML Help Workshop para criar o formato HTML Help e, é claro, o próprio PHP para fazer algumas conversões adicionais.

source: You can download the manual in various languages and formats, including plain text, plain HTML, PDF, PalmPilot DOC, PalmPilot iSilo and Windows HTML Help, from http: / /www.php.net / docs.php.
pt_br: Você pode obter o manual em várias línguas e formatos, incluindo texto simples, HTML, PDF, PalmPilot DOC, PalmPilot iSilo e Windows HTML Help, a partir do http: / /www.php.net / docs.php.

source: The manuals are updated automatically as the text is updated.
pt_br: Os manuais são automaticamente atualizados quando da alteração dos fontes.

source: You can find more information about downloading the XML source code of this documentation at http: / /cvs.php.net /.
pt_br: Para maiores informações sobre como obter os fontes XML desta documentação, veja em http: / /cvs.php.net /.

source: The documentation is stored in the phpdoc module.
pt_br: A documentação é guardada no módulo phpdoc.

source: How to help improve the documentation
pt_br: Como ajudar a melhorar a documentação

source: Translations
pt_br: Traduções

source: There are three ways you can help to improve this documentation.
pt_br: Há várias maneiras de você contribuir a melhorar essa documentação.

source: If you find errors in this manual, in any language, please report them using the bug system at http: / /bugs.php.net /.
pt_br: Se você encontrar erros no manual, em qualquer língua, notifique-os utilizando o rastreamento de bugs em http: / /bugs.php.net /.

source: Classify the bug as "Documentation Problem".
pt_br: Classifique o problema com um "Documentation Problem".

source: You can also submit problems related to specific manual formats here.
pt_br: Você também pode submeter problemas específicos dos formatos do manual nesse endereço.

source: Please don 't abuse the bug system by submitting requests for help.
pt_br: Por favor, não abuse do rastreamento de bugs para solicitar ajuda.

source: Use the mailing lists or community sites mentioned earlier, instead.
pt_br: Use as listas de discussão ou as comunidades mencionadas anteriormente.

source: By contributing notes, you can provide additional examples, caveats, and clarifications for other readers.
pt_br: Você pode também contribuir com comentários, fornecendo exemplos adicionais e esclarecimentos para outros leitores.

source: But do not submit bug reports using the annotation system please.
pt_br: Mas não envie notificações de bugs usando o sistema de comentários.

source: You can read more about annotations in the 'About user notes' section of this appendix.
pt_br: Você pode ler mais sobre os comentários na seção 'Sobre os comentários de usuários' deste apêndice.

source: If you know English and some foreign language, you may also help out in the translations.
pt_br: Se você sabe Inglês e alguma outra língua, você pode ajudar com as traduções.

source: If you would like to start a new translation, or help in a translation project, please read http: / /cvs.php.net / co.php / phpdoc / howto / howto.html.tar.gz.
pt_br: Se você deseja iniciar uma nova tradução, ou ajudar num projeto de tradução, leia o http: / /cvs.php.net / co.php / phpdoc / howto / howto.html.tar.gz.

source: How to find more information about PHP
pt_br: Como encontrar mais informações sobre o PHP

source: The PHP manual is provided in several formats.
pt_br: Sobre o manual

source: These formats can be divided into two groups: online readable formats, and downloadable packages.
pt_br: O manual do PHP é fornecido em vários formatos.

source: Some publishers have made available printed versions of this manual.
pt_br: Esses formatos podem ser divididos em dois grupos: de leitura online e em pacotes para download.

source: We cannot recommend any of those, as they tend to become out-of-date very quickly.
pt_br: Algumas editoras tornaram disponíveis versões impressas desse manual.

source: You can read the manual online at http: / /www.php.net / You can read the manual online at http: / /www.php.net / and on the numerous mirror sites.
pt_br: Você pode ler o manual online em http: / /www.php.net / Você pode ler o manual online em http: / /www.php.net / e em numerosos mirrors.

source: For best performance, you should choose the mirror site closest to you.
pt_br: Para melhor performance, escolha o mirror localizado mais fisicamente próximo a você.

source: You can view the manual in either its plain (print-friendly) HTML format or an HTML format that integrates the manual into the look and feel of the PHP website itself.
pt_br: Você pode visualizar o manual no formato HTML simples ou em um formato HTML que se assemelha ao próprio look and feel do site do PHP

source: An advantage of the online manual over most of the offline formats is the integration of user-contributed notes.
pt_br: A vantagem do manual online para a maioria dos formatos offline é a sua integração com os comentários dos usuários.

source: An obvious disadvantage is that you have to be online to view the manual in the online formats.
pt_br: A desvantagem óbvia é que você precisa estar online para ler o manual.

source: There are several offline formats of the manual, and the most appropriate format for you depends on what operating system you use and your personal reading style.
pt_br: Existem vários formatos offline do manual, e o formato mais apropriado para você depende do seu sistema operacional de seu estilo pessoal de leitura.

source: For information on how the manual is generated in so many formats, read the 'How we generate the formats' section of this appendix.
pt_br: Para informações de como esse manual é gerado e quais são esses formatos, veja a seção 'Como nós criamos os formatos' deste apêndice.

source: The most cross-platform formats of the manual are the HTML and plain-text versions.
pt_br: As versões mais independentes de plataforma são o HTML e o texto simples.

source: The HTML format is provided both as a single HTML file and as a package of individual files for each section (which results in a collection of several thousand files).
pt_br: O formato HTML é fornecido em um único arquivo e também como um pacote de arquivos individuais para cada seção (o que resulta numa coleção de vários milhares de arquivos).

source: The HTML and plaintext formats are provided as tar files compressed using the bzip2 archiver.
pt_br: Os formatos HTML e texto simples são condensados com o tar e comprimidos usando o bzip2.

source: Another popular cross-platform format, and the format most suited to printing, is PDF (also known as Adobe Acrobat).
pt_br: Outro formato popular independente de plataforma, e que ainda fornece suporte a impressão, é o PDF (também conhecido como Adobe Acrobat).

source: But before you rush to download this format and hit the Print button, be warned that the manual is nearly 2000 pages long, and constantly being revised.
pt_br: Mas antes de você baixar o manual neste formato e apertar o botão Imprimir, esteja avisado que o ele tem por volta de 2000 páginas, e está sendo constantemente revisado.

source: If you do not already have a program capable of viewing PDF format files, you may need to download Adobe Acrobat Reader.
pt_br: Se você ainda não tem um programa capaz de visualizar arquivos PDF, você precisará baixar o Adobe Acrobat Reader.

source: For owners of Palm-compatible handhelds, the Palm document and iSilo formats are ideal for this platform.
pt_br: Para proprietários de handhelds compatíveis com o Palm, os formatos DOC e iSilo são ideias para esta plataforma.

source: You can bring your handheld with you on your daily commute and use a DOC or iSilo reader to brush up on your PHP knowledge, or just use it as a quick reference.
pt_br: Você pode ter no seu handheld de seu uso diário um visualizador DOC ou iSilo para aumentar seu conhecimento em PHP, ou apenas como referência rápida.

source: For Windows platforms, the Windows HTML Help version of the manual soups up the HTML format for use with the Windows HTML Help application.
pt_br: Para a plataforma Windows, a versão HTML Help do manual condensa os originais no formato HTML para o uso com o HTML Help.

source: This version provides full-text search, a full index, and bookmarking.
pt_br: Esse formato tem busca de textos, índice completo e marcadores.

source: Many popular Windows PHP development environments also integrate with this version of the documentation to provide easy access.
pt_br: Vários ambientes de desenvolvimento populares do PHP em Windows se integram com esse formato da documentação para facilitar o acesso a documentação.

source: This manual does not attempt to provide instruction about general programming practices.
pt_br: Esse manual não fornece instruções sobre práticas gerais de programação.

source: If you are a first-time, or even just a beginning, programmer, you may find it difficult to learn how to program in PHP using just this manual.
pt_br: Se esse é seu primeiro contato, ou se ainda está iniciando em programação, você poderá encontrar dificuldade em aprender a programar em PHP apenas usando esse manual.

source: You may want to seek out a text more oriented towards beginners.
pt_br: Você precisa procurar textos destinados a orientar os iniciantes.

source: You can find a list of PHP-related books at http: / /www.php.net / books.php.
pt_br: Você pode encontrar uma lista de livros relacionados ao PHP em http: / /www.php.net / books.php.

source: There are a number of active mailing lists for discussion of all aspects of programming with PHP.
pt_br: Há também um grande número de listas de discussão ativas para todos os aspectos da programação com o PHP.

source: If you find yourself stuck on a problem for which you can 't find your own solution, you may be able to get help from someone on these lists.
pt_br: Se você se deparar com um problema que por si só não consegue solucionar, você poderá obter ajuda nestas listas.

source: You can find a list of the mailing lists at http: / /www.php.net / support.php, as well as links to the mailing list archives and other online support resources.
pt_br: Uma relação dessas listas pode ser encontrada em http: / /www.php.net / support.php, como também links para os arquivos dessas listas de discussão e outras fontes de suporte online.

source: Furthermore, at http: / /www.php.net / links.php there is a list of websites devoted to PHP articles, forums, and code galleries.
pt_br: Em http: / /www.php.net / links.php há uma relação de sites com artigos, fóruns e galerias de código PHP.

source: PHP versions documented in this manual
pt_br: Como ler a definição de função (protótipo)

source: The user-contributed notes play an important role in the development of this manual.
pt_br: Sobre as notas de usuários

source: By allowing readers of the manual to contribute examples, caveats, and further clarifications from their browser, we are able to incorporate that feedback into the main text of the manual.
pt_br: Os comentários de usuários são uma importante presença no desenvolvimento deste manual.

source: Note:
pt_br: Permitindo aos usuários do manual a contribuir com exemplos e outros esclarecimentos através de seus browsers, nós podemos incorporar esse feedback no corpo do manual.

source: The user-contributed notes are not moderated before they appear online, so the quality of the writing or code examples, and even the veracity of the contribution, cannot be guaranteed. (Not that there is any guarantee of the quality or accuracy of the manual text itself.)
pt_br: E até que as notas sejam incorporadas, os comentários podem ser visualizados na versão online e em alguns formatos offline.

source: For more details see the Manual 's Copyright page.
pt_br: As contribuições dos usuários não são moderadas antes da sua publicação online, então a qualidade desses textos e exemplos ou a veracidade e origem dessas contribuições não pode ser garantida. (Note que não há uma garantia total de qualidade ou exatidão do próprio manual.)

source: About the manual
pt_br: Sobre o manual

source: How to read a function definition (prototype)
pt_br: Como ler a definição de função (protótipo)

source: Appendix K.
pt_br: Apêndice K.

source: Each function is documented for quick reference, knowing how to read and understand the manual will make using PHP much easier.
pt_br: Cada função é documentada para referência rápida, e conhecendo como ler e entender o manual fará com que a utilização do PHP seja muito mais fácil.

source: Rather than relying on examples or cut / paste, you want to know how to read function definitions (prototypes).
pt_br: Mais do que simplesmente estudar exemplos ou copiar e colar, você precisa saber como ler as definições de função (protótipo).

source: Let 's begin:
pt_br: Vamos começar:

source: Prerequisite:
pt_br: Pré-requisito:

source: Basic understanding of types:
pt_br: Conhecimento básico dos tipos:

source: Although PHP is a loosly typed language, it 's important to have a basic understanding of types as they have important meaning.
pt_br: Mesmo sendo o PHP uma linguagem fracamente tipada, é importante ter um conhecimento básico dos tipo pois eles tem um significado importante.

source: Function definitions tell us what type of value is returned, let' s use the definition for strlen() as our first example:
pt_br: Definições de função nos dizem que tipo de valor é retornado, e vamos utilizar a definição de strlen() como nosso primeiro exemplo:

source: strlen (PHP 3, PHP 4 = 4.0.0) strlen - - Get string length Description int strlen (string str) Returns the length of string.
pt_br: strlen (PHP 3, PHP 4 = 4.0.0) strlen - - Obtêm o tamanho da string Description int strlen (string str) Retorna o comprimento da string.

source: Table K-1.
pt_br: Tabela K-1.

source: Explanation of a function definition
pt_br: Detalhamento da definição da função

source: Part
pt_br: Parte

source: The function name.
pt_br: Nome da função.

source: strlen() has been around in both all of PHP 3 and PHP 4
pt_br: strlen() está disponível em todos os PHP 3 e PHP 4

source: The length of a string is measured in numbers).
pt_br: Tipo do valor que esta função retorna, que no caso é um inteiro (no caso, o comprimento de uma string é medida em números).

source: The first (and in this case the only) parameter / argument for the function strlen() is named str, and it's a string.
pt_br: O primeiro (e neste caso, o único) parâmetro / argumento da função strlen() é chamado str, e é uma string.

source: We could rewrite the above function definition in a generic way:
pt_br: Nos podemos reescrever a definição de função acima de maneira genérica:

source: returned type function name (parameter type parameter name)
pt_br: tipo retornado nome da função (parametro tipo parametro tipo)

source: Many functions take on multiple parameters, such as in_array().
pt_br: Muitas funções tem parâmetros multiplos, como in_array().

source: It 's prototype is as follows:
pt_br: Seu protótipo é como:

source: What does this mean? in_array() returns a boolean value, TRUE on success (the needle was found in the haystack) or FALSE on failure (the needle was not found in the haystack).
pt_br: O que isso significa? in_array() retorna um valor booleano, TRUE em caso de sucesso (needle foi encontrado em haystack) ou FALSE em caso de falha (needle não foi encontrado em haystack).

source: The first parameter is named needle and it can be many different types, so we call it "mixed".
pt_br: O primeiro parâmetro é chamado needle e pode de ser de vários tipos, por isso nós dizemos que ele é "mixed".

source: This mixed needle (what we're looking for) can either be a scalar value (string, integer, or float), or an array. haystack (the array we're searching in) is the second parameter.
pt_br: Esse needle mixed (que nós estamos procurando) pode ser tanto um valor escalar (string, inteiro, ou float), ou um array. haystack (o array onde nós estamos procurando) é o segundo parâmetro.

source: The third optional parameter is named strict.
pt_br: O terceiro parâmetro opcional é chamado strict.

source: All optional parameters are seen in [brackets].
pt_br: Todos os parâmetros opcionais aparecem dentro de [colchetes].

source: The manual states that the strict parameter defaults to boolean FALSE.
pt_br: O manual diz que o default do parâmetro strict é o booleano FALSE.

source: See the manual page on each function for details on how they work.
pt_br: Veja a página de do manual de cada função para detalhes de como elas funcionam.

source: About user notes
pt_br: Sobre as notas de usuários

source: The PHP manual is not only available in various formats, it is also available in various languages.
pt_br: O manual do PHP não está disponível apenas em vários formatos, mas também em várias línguas.

source: The text of the manual is first written in english, then teams of people across the world take care of translating it to their native language.
pt_br: O texto do manual é primeiramente escrito em Inglês, então um time de pessoas ao redor do mundo fazem a tradução em suas línguas natais.

source: If a translation for a specified function or chapter has not yet been made, the build system of the manual falls back to the english version of it.
pt_br: Se a tradução de uma função específica ou de um capítulo ainda não foi realizada, o sistema de compilação do manual utiliza a versão original em Inglês.

source: Peoples involved in the translations start from the XML source code available from http: / /cvs.php.net / and from it they translate to thier mother language.
pt_br: As pessoas envolvidas na tradução iniciam a partir dos fontes XML disponíveis em http: / /cvs.php.net / e partir daí traduzem para sua lingua mãe.

source: They do not use the HTML, the plain text, or the PDF version.
pt_br: Eles não utilizam as versões HTML, texto ou PDF.

source: It is the build system which takes care of the conversions from XML to human readable formats.
pt_br: É o sistema de compilação do manual que converte os fontes XML para formatos mais legíveis.

source: If you would like to help translating the documentation to your native language, please get in touch with the translation / documentation team subscribing to the phpdoc mailinglist: send an empty mail to phpdoc-subscribe@lists.php.net.
pt_br: Se você quiser colaborar com a tradução da documentação para a sua língua, entre e contato com o time de documentação e tradução, inscrevendo-se na lista de discussão phpdoc: para isso, encaminhe um e-mail em branco para phpdoc-subscribe@lists.php.net.

source: The mailing list address is phpdoc@lists.php.net.
pt_br: O endereço da lista é em phpdoc@lists.php.net.

source: State in the message that you are interested in translating the manual to a language and someone will get back to you, helping you start a new language translation or reach the already active documentation team for your language.
pt_br: Depois, encaminhe uma mensagem mencionando seu interesse em traduzir o manual para uma língua que você receberá retorno, fornecendo ajuda para você começar a tradução para uma nova língua ou participar do time de documentação da sua língua.

source: At the moment the manual is available, partly or not, in the following languages:
pt_br: Atualmente o manual está disponível, parcialmente ou não, nas seguintes línguas:

source: Brazilian Portuguese, Chinese, Czech, Dutch, French, German, Hungarian, Italian, Japanese, Korean, Polish and Spanish.
pt_br: Português (Brasil), Chinês, Checo, Holandês, Francês, Alemão, Húngaro, Italiano, Japonês, Koreano, Polonês e Espanhol.

source: They all can be downloaded here: http: / /www.php.net / docs.php.
pt_br: Todos eles podem ser baixados aqui: http: / /www.php.net / docs.php.

source: How we generate the formats
pt_br: Como nós geramos os formatos

source: Missing Stuff
pt_br: Identificadores faltando (compilação do manual)

source: Prev
pt_br: Apêndice F.

source: Here is the aliases list.
pt_br: Esta é a lista de funções sinônimas.

source: All aliases are listed here.
pt_br: Todas as funções sinônimas estão listadas aqui.

source: It is usually a bad idea to use aliases, as they may be bound to obsolescence or renaming, which will lead to unportable script.
pt_br: Normalmente é uma má idéia utiliza-lás, pois elas estão em vias de ficarem obsoletas ou serem renomeadas, o que criaria um script não portável.

source: This list is provided to help those who want to upgrade their old scripts to newer syntax.
pt_br: Esta lista é fornecida para ajudar aqueles que querem atualizar os seus scripts antigos para a nova sintaxe.

source: However, some functions simply have two names, and there is no real preference. (For example, is_int() and is_integer() are equally good)
pt_br: De qualquer forma, alguma funções simplesmente tem dois nomes e não tem real preferência. (Por exemplo, is_int() e is_integer() são igualmente boas)

source: For an alias list that updates daily, have a look here.
pt_br: Esta lista é consistente com o PHP versão 4.0.6.

source: Table F-1.
pt_br: Tabela F-1.

source: Aliases
pt_br: Sinônimos

source: Alias
pt_br: Função sinônimo (alias)

source: Master function
pt_br: Função mestre

source: Extension used
pt_br: Extensão usada

source: List of Reserved Words
pt_br: Palavras reservadas do PHP

source: Miscellaneous Questions
pt_br: Próxima

source: History of PHP and related projects
pt_br: A História do PHP e projetos relacionados

source: Appendix E.
pt_br: Apêndice E.

source: This is the hash table in which the function is to be looked up.
pt_br: HashTable *function_table

source: This is a pointer to an object on which the function is invoked.
pt_br: pval *object

source: The name of the function to call.
pt_br: pval *function_name

source: The structure must be previously allocated - call_user_function() does NOT allocate it by itself.
pt_br: int param_count

source: A pseudo-object oriented mechanism for reading a directory.
pt_br: dir - - classe diretório

source: The given directory is opened.
pt_br: Um mecanismo pseudo-orientado a objeto para ler um diretório.

source: Two properties are available once the directory has been opened.
pt_br: Duas propriedades são disponíveis uma vez que o diretório foi aberto:

source: The handle property can be used with other directory functions such as readdir(), rewinddir() and closedir().
pt_br: A propriedade handle pode ser usada com outras funções de diretório como readdir(), rewinddir() e closedir().
